In [37]:
#Updating Rows and Columns- Modifying Data Within DataFrames

In [2]:
people={"first":["Corey","Jane","John"],
        "last":["Schafer","Doe","Doe"],
        "email":["CoreyMSchafer@gmail.com","JaneDoe@email.com","JohnDoe@email.com"]}

In [3]:
import pandas as pd

In [4]:
df=pd.DataFrame(people)

In [5]:
df

   first     last                    email
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [6]:
df.columns

Index(['first', 'last', 'email'], dtype='object')

In [7]:
df.columns=["First_Name","Last_Name","Emails"]

In [8]:
df

  First_Name Last_Name                   Emails
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [9]:
df.columns=[x.lower() for x in df.columns]

In [10]:
df

  first_name last_name                   emails
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [11]:
df.columns=df.columns.str.replace("_"," ")

In [12]:
df

  first name last name                   emails
0      Corey   Schafer  CoreyMSchafer@gmail.com
1       Jane       Doe        JaneDoe@email.com
2       John       Doe        JohnDoe@email.com

In [13]:
df.rename(columns={'first name':'first','last name':'last','emails':'email_id'},inplace=True)
df

   first     last                 email_id
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John      Doe        JohnDoe@email.com

In [14]:
df.loc[2]

first                    John
last                      Doe
email_id    JohnDoe@email.com
Name: 2, dtype: object

In [15]:
df.loc[2,['last','email_id']]=['Smith','JohnSmith@email.com']
df

   first     last                 email_id
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [16]:
df.at[2,['last','email_id']]=['Smith','JohnSmith@email.com']
df

   first     last                 email_id
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2   John    Smith      JohnSmith@email.com

In [17]:
filt = (df['email_id'] == 'JohnSmith@email.com')
df[filt]

  first   last             email_id
2  John  Smith  JohnSmith@email.com

In [18]:
df.loc[filt,'first']=['Joe']
df.loc[filt,'email_id']=['JoeSmith@email.com']
df

   first     last                 email_id
0  Corey  Schafer  CoreyMSchafer@gmail.com
1   Jane      Doe        JaneDoe@email.com
2    Joe    Smith       JoeSmith@email.com

In [19]:
df['email_id']=df['email_id'].str.lower()
df

   first     last                 email_id
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2    Joe    Smith       joesmith@email.com

In [20]:
df['email_id'].apply(len)

0    23
1    17
2    18
Name: email_id, dtype: int64

In [21]:
def update_email(email_id):
    return email_id.upper()

In [22]:
df['email_id']=df['email_id'].apply(update_email)

In [23]:
df

   first     last                 email_id
0  Corey  Schafer  COREYMSCHAFER@GMAIL.COM
1   Jane      Doe        JANEDOE@EMAIL.COM
2    Joe    Smith       JOESMITH@EMAIL.COM

In [24]:
df['email_id']=df['email_id'].apply(lambda x: x.lower())

In [25]:
df

   first     last                 email_id
0  Corey  Schafer  coreymschafer@gmail.com
1   Jane      Doe        janedoe@email.com
2    Joe    Smith       joesmith@email.com

In [26]:
df['email_id'].apply(len)

0    23
1    17
2    18
Name: email_id, dtype: int64

In [27]:
df.apply(len)

first       3
last        3
email_id    3
dtype: int64

In [28]:
df.apply(len,axis='columns')

0    3
1    3
2    3
dtype: int64

In [29]:
df.apply(pd.Series.min)

first                         Corey
last                            Doe
email_id    coreymschafer@gmail.com
dtype: object

In [30]:
df.apply(pd.Series.max)

first                      Joe
last                     Smith
email_id    joesmith@email.com
dtype: object

In [31]:
df.apply(lambda x : x.min())

first                         Corey
last                            Doe
email_id    coreymschafer@gmail.com
dtype: object

In [32]:
df.applymap(len)

   first  last  email_id
0      5     7        23
1      4     3        17
2      3     5        18

In [33]:
df.applymap(str.lower)

   first     last                 email_id
0  corey  schafer  coreymschafer@gmail.com
1   jane      doe        janedoe@email.com
2    joe    smith       joesmith@email.com

In [34]:
df['first'].map({'Corey':'Chris','Jane':'Marry'})

0    Chris
1    Marry
2      NaN
Name: first, dtype: object

In [35]:
df['first']=df['first'].replace({'Corey':'Chris','Jane':'Marry'})

In [36]:
df

   first     last                 email_id
0  Chris  Schafer  coreymschafer@gmail.com
1  Marry      Doe        janedoe@email.com
2    Joe    Smith       joesmith@email.com